---
kind: other
id: Properties.T:Autodesk.Revit.DB.SymbolGeometryId
source: html/7bb31157-91f7-f2fa-3438-db12079b9f03.htm
---
# SymbolGeometryId Properties

Specifies whether the .NET object represents a valid Revit entity.